src/DataProcessors/РаботаСПеречислениями/РаботаСПеречислениями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСПеречислениями</name>
</mdclass:DataProcessor>

src/Enums/СистемаНалогооблажения/СистемаНалогооблажения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СистемаНалогооблажения</name>
  <enumValues>
    <name>Общая</name>
  </enumValues>
  <enumValues>
    <name>Упрощенная</name>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/РаботаСПеречислениями/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ОбратитьсяКЗначению(Команда)
	ОбратитьсяКЗначениюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбратитьсяКЗначениюНаСервере()
	
	СтароеЗначение = Константы.СистемаНалогооблажения.Получить();
	Если СтароеЗначение = Перечисления.СистемаНалогооблажения.Общая Тогда
		Сообщить("Изменять систему налогообложенния нельзя!");
		Возврат;
	КонецЕсли; 
	
	НовоеЗначение = Перечисления.СистемаНалогооблажения.Упрощенная;
	Константы.СистемаНалогооблажения.Установить(НовоеЗначение);
	
КонецПроцедуры
